Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '用户协议',
    contents: [{
      sub_title: '',
      sub_contents: [
        '“蒲公英”平台的微信小程序名称为“蒲公英”。下简称“蒲公英小程序”）是由深圳蒲公英农业科技有限公司（下称“蒲公英公司”）自建并运营的购物平台。蒲公英公司将通过蒲公英小程序向您提供优质的商品及相关服务，并严格遵守本协议及相关承诺。',
        '当您通过蒲公英小程序注册成为用户或以其它方式获得其提供的商品及相关服务时，即表明您已经完全接受并签署了本协议。'
      ]
    },{
      sub_title: '一．协议接纳',
      sub_contents: [
        '1.1 如果您通过蒲公英小程序购买商品或接受服务的，应当遵守蒲公英公司《注册服务协议》（下简称“协议”）。 ',
        '1.2 您在点击“同意”之前，应当认真阅读协议相关内容。 ',
        '1.3 您应当认真阅读本协议，对于协议中粗体字的内容和涉及重要权益的内容，您应当加以重点阅读。 如果您对本协议中的某一或某些条款产生疑问，您应当向蒲公英公司咨询。如果您不同意本协议中的某一或某些条款，您应当立即停止注册。',
        '1.4 本协议为电子形式的协议，是处理您与蒲公英公司一切权利义务关系的约定，对双方均具有法律约束力。',
        '1.5 蒲公英小程序上所发布的一切规则均是本协议的特殊条款，是本协议不可分割的组成部分。因此，当您完全接受本协议时，当然且确定的表明您也完全接受本协议的特殊条款。',
        '1.6 蒲公英公司根据经营需要对本协议作出的新修订，或其在蒲公英小程序上不时发布的新规则对您具有法律约束力。如果您不愿意接受，请您停止注册，或停止使用“蒲公英”小程序。',
      ]
    },{
      sub_title: '二．服务说明',
      sub_contents: [
        '2.1 蒲公英公司通过其自建的“蒲公英”小程序运营系统，为您提供商品交易、物流配送、售后服务等服务项目。除此之外，“蒲公英”小程序所不时推出的新商品和新服务均属于本协议的调整范围。',
        '2.2 为使用蒲公英小程序，您应当自行负责接入国际互联网，以及配备上网所需的一切硬件设备，包括但不限于手机、计算机或其它存取设备。由此所产生的一切费用，您同意蒲公英公司不予承担。',
        '2.3 为方便您使用蒲公英小程序，蒲公英公司尽最大努力保障网络的畅通性。但是由于互联网服务的特殊性，蒲公英公司不保证服务不会中断，也不担保服务的绝对安全性和准确性。',
        '2.4 为保障您的利益或提高服务质量，蒲公英公司有权定期或不定期的对小程序或相应的系统进行检修、维护或升级，您对此表示理解和支持。',
      ]
    },{
      sub_title: '三．网上注册',
      sub_contents: [
        '3.1 当您登陆蒲公英小程序注册系统进行注册时，您应当具备完全民事权利能力和完全民事行为能力。如果您不具备完全民事权利能力或完全民事行为能力，您应当停止注册。如果您违反本项规定而进行注册，蒲公英公司将有权注销您的账户。',
        '3.2 您应该根据蒲公英小程序系统的要求填写必要的注册信息和账户信息，并保证信息的合法性、真实性、及时性和有效性，否则后续所产生的一系列后果将由您自己负责。注册成功后，如果您所填写的信息发生改变，您应当及时登录蒲公英小程序变更相关内容。',
        '3.3 如果蒲公英公司发现您填写的注册信息和账户信息存在违法、不真实或无效的可能性，蒲公英公司有权删除相关信息或注销您的账户。',
        '3.4 注册成功后，您将获得蒲公英小程序为您提供的用户名。该用户名的所有权归属于蒲公英公司，您对用户名仅具有使用权。',
        '3.5 您愿意接受由蒲公英公司以手机短信、微信等方式发送的任何广告和其它商业信息。',
        '3.6 您不得将您注册的用户名及其对应密码转让、出借或出租给任何第三方使用，您应当为在该用户名下所发生的一切行为负责。',
        '3.7 为保证交易安全，您应当妥善保管用户名和密码，并对他人使用您的手机设定限制。如果因为您的疏忽或管理不善，造成用户名和密码外泄、被盗等后果的，您应当自行承担由此所引发的一切损失。',
      ]
    },{
      sub_title: '四．商品信息',
      sub_contents: [
        '4.1 蒲公英小程序上所发布的一切商品信息，包括但不限于图片、文字说明，均供您决定是否订购商品，一旦您在决定订购商品后通过小程序系统提交订单，即表明您向蒲公英公司发出了明确的购买该商品的意图。',
        '4.2 蒲公英公司有义务最大限度的提高商品信息的准确性、及时性、完整性和有效性。但是您认同，由于信息复杂、信息量庞大以及互联网技术问题，商品信息出现误差或错误在所难免。因此，蒲公英公司不必因此而承担法律责任。',
        '4.3 为最大限度的提高商品信息的准确性、及时性、完整性和有效性，蒲公英公司有权利对商品信息进行不间断的监测、修改或删除，您对此表示理解和支持。',
        '4.4 当您通过小程序系统提交订单后，商品信息发生变化的，您不得以变更后的商品信息主张权利或要求蒲公英公司承担责任。',
        '4.5 因小程序系统或互联网技术性问题导致商品信息发生错误的，蒲公英公司有权视情况取消订单或作其它处理。',
        '4.6 蒲公英公司不对商品的适用性及商品能够满足您的特定需求做任何保证。',
        '4.7 为方便您直观的了解商品和相关服务，蒲公英公司可以以图片或视频的形式展示商品，但是您应当认同图片或视频与真实商品之间具有直观上的差异性。',
      ]
    },{
      sub_title: '五．商品订购',
      sub_contents: [
        '5.1 如果您使用蒲公英小程序购买商品或相关服务，请务必依据系统程序填写并提交订单。当您提交订单后，小程序系统将自动向您的微信账号发送确认回执。无论您所收到确认回执如何描述，该确认回执仅表示蒲公英小程序已经收到您的订单要约。',
        '5.2 蒲公英公司特别提醒您，请在购买商品或相关服务之前，务必认真了解有关商品的所有信息。在订单提交成功之后，您不得以不了解商品的相关信息而主张撤销订单。',
        '5.3 当您使用蒲公英小程序购买商品或相关服务时，请务必依据本协议及系统程序进行操作。您不得以不了解本协议及系统程序为由主张订单无效或可撤销。',
        '5.4 蒲公英小程序收到您的订单后，将会及时审核订单。经审核无误，蒲公英公司将安排商品配送。如果蒲公英公司认为订单存在疑问，无论您是否已经支付价款，蒲公英公司均有权取消订单，或通过短信、电话等沟通渠道要求您变更订单。',
        '5.5 因市场存在难以控制的商业因素，您订购或拟订购的商品有可能存在缺货现象，如果缺货，蒲公英公司将无法配送，此时，您有权取消订单。',
        '5.6 如果蒲公英小程序推出预订商品，您可以根据小程序的相关预订规则提交订单。蒲公英公司可以根据实际情况决定是否接受订单，如果接受订单，蒲公英公司将按照预订规则和您的合理要求向您配送商品。',
        '5.7 当您提交订单时，请务必确认商品信息和价格信息。蒲公英小程序对商品信息和价格信息作出变动的，将以最终出货单的信息为准。',
        '5.8 蒲公英公司根据本协议的规定拒绝、取消或不接受订单的，您同意自行承担一切责任，但是有特别规定的除外。',
      ]
    },{
      sub_title: '六．商品价格及货款结算',
      sub_contents: [
        '6.1 为方便您选购商品，蒲公英公司会在蒲公英小程序的相应位置公布商品价格。当您订购商品并提交订单后，您所收到的来自蒲公英小程序的确认回执将包含相应的商品价格信息。',
        '6.2  商品价格已包含平台服务的附加费用，增值税如有需要，经申请可向相应供应商索取。',
        '6.3 蒲公英公司可以根据市场变化或市场竞争的需要不时的变更商品价格。如果价格变更发生在您提交订单之前，您所订购商品的价格以变更后的价格为准。如果您提交订单后发生了价格变更，您所订购商品的价格以您收到最终出货单时的价格为准。',
        '6.4 提交订单后，蒲公英公司发现由于人工操作失误或技术问题导致定价错误，您同意按如下方式处理：',
        '（1）如果您所订购商品的正确价格（以蒲公英小程序对相应商品价格的再次公布为准，下同）低于错误定价，蒲公英公司有义务按较低价格收取您的付款。',
        '（2）如果您所订购商品的正确价格高于错误定价，蒲公英公司将会与您沟通，并根据实际情况作出重新调价、取消订单或停止配送的处理，此时，您也有权取消订单。',
        '6.5 “行情价”或横线划去的价格不同于原价，其是方便您购物时参考的预估市场价，而非本小程序在降价前七日内的最低交易价格。',
        '6.6 您在下单后，10分钟内需全额付清货款，未及时付款的订单将被取消并作废，您需要重新下单购买。',
      ]
    },{
      sub_title: '七．促销规则',
      sub_contents: [
        '7.1 促销活动是指在一定时期内，蒲公英公司针对某些商品作让利处理或针对消费者群体开展的优惠激励措施。',
        '7.2 促销形式包括如下三种情形：',
        '（1）某些商品集合内的满减、满返和满增；',
        '（2）相对于原小程序定价的直接降价；',
        '（3）在结算时使用优惠券抵扣订单金额；',
        '（4）其它符合7.1约定的情形。',
        '7.3 促销活动的目的是为满足您及其他消费者的消费需求，一切以牟利、排挤竞争为意图或者为达到其它恶意目的的参与行为均不予接受。',
        '7.4 使用同一账户参与促销活动时，应当遵守促销活动规则，超过份数限制的订单作无效处理，蒲公英公司有权取消或停止发货。',
        '7.5 蒲公英公司发现与促销活动相关的订单中的配送地址相同或相近的，相关订单无效，蒲公英公司有权取消或停止发货。',
        '7.6 蒲公英公司发现与促销活动相关的订单中的收货人信息相同或相近的，相关订单无效，蒲公英公司有权取消或停止发货。',
        '7.7 蒲公英公司有合理理由怀疑用户有恶意参加促销活动的，相关订单无效，蒲公英有权取消或停止发货。',
        '7.8 蒲公英公司开展促销活动时所临时发布的活动规则与上述不一致的，以临时发布的规则为准。',
      ]
    },{
      sub_title: '八．物流配送',
      sub_contents: [
        '8.1 您订购的商品，蒲公英公司将依靠其自建物流系统直接进行物流配送服务，或授权其他指定物流代办托运，同时并收取相关配送服务费。',
        '8.2 蒲公英公司根据您提供的收货人信息及您在备注信息栏中填写的合理信息安排商品配送。如果收货人不是您本人，收货人的行为即为您本人的行为，收货人与您应当承担连带责任。',
        '8.3 订单生成后，您通过与蒲公英公司的沟通变更了收货人信息或备注信息的，实际配送服务将依据您变更后的信息作出安排。',
        '8.4 蒲公英公司在特别条款（《服务承诺》）中所承诺的配送时效均为一般配送时间，该时间仅作为您订购商品的参考因素。',
        '8.5 发生下列情形之一的，蒲公英公司不承担迟延送达的违约责任：',
        '（1）发生不可抗力或情势变更事件的；',
        '（2）因您提供的信息有误、过时、缺失，或根据您提供的信息无法判断收货人或收货地址的；',
        '（3）因网络故障、系统故障、系统检修、维护或升级导致迟延送达的；',
        '（4）因路途遥远且交通不便造成迟延送达的；',
        '（5）为满足您的配送要求及特殊需要而迟延送达的。',
        '（6）由其他物流、快递代办托运的。',
      ]
    },{
      sub_title: '九.关于售后',
      sub_contents: [
        '水果属于生鲜产品，果品有合理损耗属正常现象。订货前，您需了解清楚果品的信息后再进行下单，到货后的2小时内将产品损耗情况提供给蒲公英公司，您会根据报损服务规则进行相应的补损；您超过2小时未主张报损的，视为商品无质量问题，后续不再受理报损。',
      ]
    },{
      sub_title: '十．知识产权',
      sub_contents: [
        '10.1 除您及其它用户向蒲公英小程序所发布的评论、订单、图片或视频之外，蒲公英公司对蒲公英小程序及小程序上所显示的其它所有信息资料，包括但不限于商标、软件系统、宣传图案、商品图片、商品信息、视频资料和文字信息，享有绝对的、完全的知识产权。',
        '10.2 未经蒲公英公司同意，您不得以任何方式修改、复制和传播蒲公英公司享有知识产权的信息资料。',
        '10.3 对于您在蒲公英小程序上所发布的一切信息资料，您同意授予蒲公英公司独家的、永久的、免费的许可使用权利。您确认，蒲公英公司对您所发布的信息资料的使用是基于您对信息资料内容的合法性、真实性的承诺之上，蒲公英公司因使用该信息资料而遭受索赔、指控的，您应当承担全部责任。',
      ]
    },{
      sub_title: '十一．隐私保护',
      sub_contents: [
        '11.1 蒲公英公司保证不对外公开或向任何第三方透露您的注册信息、账户信息和交易信息，但是存在下列情形之一的除外：',
        '（1）公开或透露相关信息之前获得您许可的；',
        '（2）根据法律或政策的规定而公开或透露的；',
        '（3）为向您提供商品或服务而需要公开或透露的；',
        '（4）蒲公英公司为保护自身利益而公开的；',
        '（5）根据本协议其它约定而公开或透露的。',
        '11.2 为了向您提供优质的服务，您同意蒲公英公司将您的注册信息、账户信息和交易信息提供给蒲公英公司的关联公司以及与蒲公英公司合作的第三方。',
        '11.3 蒲公英公司根据本协议的规定对小程序或相应的系统进行检修、维护或升级时，有可能丢失、损坏或泄漏您的注册信息、账户信息或交易信息，您对此表示理解，且不要求蒲公英公司承担责任。',
        '11.4 为保证交易安全以及保障您的合法权益，蒲公英公司建议您对注册信息、账户信息和交易信息进行数据备份。',
      ]
    },{
      sub_title: '十二．协议终止',
      sub_contents: [
        '12.1 蒲公英公司有权经通知后终止本协议，您有权请求蒲公英公司作出终止本协议的决定。',
        '12.2 发生下列情形之一的，蒲公英公司有权立即终止协议：',
        '（1）本协议发生变更后，您明确通知蒲公英公司不愿意接受新协议或变更内容的；',
        '（2）蒲公英公司发现您连续1个月内注册用户数量超过3个的；',
        '（3）蒲公英发现您为达到排挤竞争对手、实施不正当竞争的目的而注册用户的，或者蒲公英发现您有其它恶意目的注册用户，扰乱正常经营秩序的；',
        '（4）蒲公英公司发现您恶意注册用户，扰乱正常经营秩序的；',
        '（5）蒲公英公司发现您对订单多次恶意拒收，扰乱正常经营秩序的；',
        '（6）您注册账户后，连续3个月不使用该账户的；',
        '（7）您通过本小程序进行违法犯罪活动的。',
        '12.3 协议终止后，您在蒲公英小程序上的积分、优惠券和礼品卡均失效，蒲公英公司不予兑现。',
        '12.4 协议终止后，您同意蒲公英公司在2年内继续保留您的注册信息、账户信息以及交易记录。',
        '12.5 协议终止后，蒲公英公司有权向他人开放您所注册使用的用户名。',
        '12.6 如果您在协议终止之前存在违反本协议的行为，蒲公英公司有权依据本协议追究您的法律责任。',
      ]
    },{
      sub_title: '十三．法律适用',
      sub_contents: [
        '13.1 本协议的签订、履行和执行及解释均适用中华人民共和国法律法规。如果中华人民共和国法律法规没有相关规定，则适用中华人民共和国的商业惯例。',
        '13.2 如果本协议的相关规定违反中华人民共和国法律法规的相应条款，则适用中华人民共和国法律法规。如果本协议的相关规定违反中华人民共和国的相关商业惯例，则仍然以本协议为准。',
      ]
    },{
      sub_title: '十四．纠纷解决',
      sub_contents: [
        '14.1 因本协议发生的任何争议，蒲公英公司与您应当友好协商，协商不成的，您同意蒲公英公司提交至深圳市仲裁委员会仲裁，仲裁送达将通过您注册时登记的邮箱的方式送达，并且同意因仲裁程序所产生的律师费、仲裁费用由败诉方承担。',
      ]
    }]
  },
})